/*

	C 数据类型：

		1、基本类型

			它们是算术类型，包括两种类型：整数类型和浮点类型。

		2、枚举类型

			它们也是算术类型，被用来定义在程序中只能赋予其一定的离散整数值的变量。

		3、void 类型

			类型说明符 void 表明没有可用的值。

		4、派生类型

			它们包括：指针类型、数组类型、结构类型、共用体类型和函数类型。

		数组类型和结构类型统称为聚合类型。函数的类型指的是函数返回值的类型


		整数类型

			char			1 字节			-128 到 127 或 0 到 255
			unsigned char	1 字节			0 到 255
			signed char		1 字节			-128 到 127
			int				2 或 4 字节		-32,768 到 32,767 或 -2,147,483,648 到 2,147,483,647
			unsigned int	2 或 4 字节		0 到 65,535 或 0 到 4,294,967,295
			short			2 字节			-32,768 到 32,767
			unsigned short	2 字节			0 到 65,535
			long			4 字节			-2,147,483,648 到 2,147,483,647
			unsigned long	4 字节			0 到 4,294,967,295


		浮点类型

			float			4 字节			1.2E-38 到 3.4E+38	6 位小数
			double			8 字节			2.3E-308 到 1.7E+308	15 位小数
			long double		16 字节			3.4E-4932 到 1.1E+4932	19 位小数


		void 类型

			1	函数返回为空

					C 中有各种函数都不返回值，或者您可以说它们返回空。
				
					不返回值的函数的返回类型为空。例如 void exit (int status);

			2	函数参数为空

					C 中有各种函数不接受任何参数。

					不带参数的函数可以接受一个 void。例如 int rand(void);

			3	指针指向 void 

					类型为 void * 的指针代表对象的地址，而不是类型。
				
					例如，内存分配函数 void *malloc( size_t size ); 返回指向 void 的指针，可以转换为任何数据类型。

		
		笔记

			常用基本数据类型占用空间（64位机器为例）
			 	char ： 1个字节
			 	int ：4个字节
			 	float：4个字节
			 	double：8个字节
			基本类型书写
			整数
			 	a，默认为10进制 ，10 ，20。
			 	b，以0开头为8进制，045，021。
				c.，以0b开头为2进制，0b11101101。
				d，以0x开头为16进制，0x21458adf。
			小数
			单精度常量：2.3f 。
			双精度常量：2.3，默认为双精度。
			字符型常量
			用英文单引号括起来，只保存一个字符'a'、'b' 、'*' ，还有转义字符 '\n' 、'\t'。
			字符串常量
			用英文的双引号引起来 可以保存多个字符："abc"。
		
			1、数据类型转换：C 语言中如果一个表达式中含有不同类型的常量和变量，在计算时，会将它们自动转换为同一种类型；在 C 语言中也可以对数据类型进行强制转换；
			2、自动转换规则：
			 	a）浮点数赋给整型，该浮点数小数被舍去；
			 	b）整数赋给浮点型，数值不变，但是被存储到相应的浮点型变量中；
			3、强制类型转换形式: (类型说明符)(表达式)

*/

#include <stdio.h> // printf()
// #include <limits.h> // sizeof(int)
#include <float.h> // 定义 float 类型的宏，FLT_MIN, FLT_MAX, FLT_DIG...
 
int main()
{
   	printf("int 存储大小 : %lu \n", sizeof(int)); // 使用 sizeof() 运算符获取某个类型在该平台上精准的大小
   

   	printf("float 存储最大字节数 : %lu \n", sizeof(float));
	printf("float 最小值: %E\n", FLT_MIN );
	printf("float 最大值: %E\n", FLT_MAX );
	printf("精度值: %d\n", FLT_DIG ); 		// %E 为以指数形式输出单、双精度实数


	float f,x=3.6,y=5.2;
   	int i=4,a,b;
   	a=x+y;
  	b=(int)(x+y);
   	f=10/i;
   	printf("a=%d,b=%d,f=%f,x=%f\n",a,b,f,x);

   	// 例中先计算 x+y 值为 8.8，然后赋值给 a，因为a为整型，所以自取整数部分8，a=8;
   	// 接下来 b 把 x+y 强制转换为整型;
   	// 最后 10/i 是两个整数相除，结果仍为整数 2，把 2 赋给浮点数 f;
   	// x 为浮点型直接输出。


   	return 0; 		// %lu 为 32 位无符号整数
}

/*
	结果：
	int 存储大小 : 4 
	float 存储最大字节数 : 4 
	float 最小值: 1.175494E-038
	float 最大值: 3.402823E+038
	精度值: 6
	a=8,b=8,f=2.000000,x=3.600000
*/

// 1 字节 =  8 位
// 1.2e-38 科学计数法，等价于 1.2 x 10^38